#define N(args)                                                                \
  void args(long α, struct τext *ω, struct τext *ο, long ρ, long δ)
typedef struct τext {
  union {
    void *v;
    long q;
    const char *cs;
    struct τext *t;
    N((*c));
  };
} τext;
#include <stdio.h>
#include <unistd.h>
void wait();
N(m) { wait(), ω[3 * δ].c(α, ω + 3 * δ, ο, ρ, δ); }
N(a) { wait(), ω[3 * δ].c(α, ω + 3 * δ, ο, ρ, δ); }
N(v) { wait(), ω[3 * δ].c(α, ω + 3 * δ, ο, ρ, δ); }
N(n) { wait(), ω[3 * δ].c(α, ω + 3 * δ, ο, ρ, δ); }
void line_to(long, long);
N(t) { line_to((ρ + 1) * δ, δ), ω[3 * δ].c(α, ω + 3 * δ, ο, ρ, δ); }
N(p) {
  if (δ > 0)
    ω[3].c(α, ω + 3, ο, 0, 1);
  else if (ρ == 0)
    ω[-3].c(α, ω - 3, ο, 0, -1);
  else if (ρ < 4)
    ω[3].c(α, ω + 3, ο, ρ + 1, 1);
  else
    ω[-3].c(α, ω - 3, ο, 1 + ω[-1].q++ % 4, -1);
}
N(o) { ω[-3].c(α, ω - 3, ο, ρ, -1); }
void rotate();
N(w0) { rotate(), ω[1].t[4].c(α, ω[1].t + 4, ο, ρ, 1); }
N(w1) { rotate(), ω[1].t[4].c(α, ω[1].t + 4, ο, ρ, 1); }
N(w2) { rotate(), ω[1].t[4].c(α, ω[1].t + 4, ο, ρ, 1); }
N(w3) { rotate(), ω[1].t[4].c(α, ω[1].t + 4, ο, ρ, 1); }
void init_gut();
void clear_gut();
int main(int argc, char **argv) {
  init_gut();
  // clang-format off
  τext ω[4][45] = {
      { {.q = 0}, {{w0}},   {.q = 0},
        {.q = 0}, {{t}},    {.q = 0},
        {.q = 0}, {{p}},    {.q = 0},
        {.q = 0}, {{t}},    {.q = 0},
        {.q = 0}, {{m}},    {.q = 0},
        {.q = 0}, {{t}},    {.q = 0},
        {.q = 0}, {{p}},    {.q = 0},
        {.q = 0}, {{t}},    {.q = 0},
        {.q = 0}, {{a}},    {.q = 0},
        {.q = 0}, {{t}},    {.q = 0},
        {.q = 0}, {{o}},    {.q = 0}},
      { {.q = 0}, {{w1}},   {.q = 0},
        {.q = 0}, {{t}},    {.q = 0},
        {.q = 0}, {{p}},    {.q = 0},
        {.q = 0}, {{t}},    {.q = 0},
        {.q = 0}, {{a}},    {.q = 0},
        {.q = 0}, {{t}},    {.q = 0},
        {.q = 0}, {{p}},    {.q = 0},
        {.q = 0}, {{t}},    {.q = 0},
        {.q = 0}, {{v}},    {.q = 0},
        {.q = 0}, {{t}},    {.q = 0},
        {.q = 0}, {{o}},    {.q = 0}},
      { {.q = 0}, {{w2}},   {.q = 0},
        {.q = 0}, {{t}},    {.q = 0},
        {.q = 0}, {{p}},    {.q = 0},
        {.q = 0}, {{t}},    {.q = 0},
        {.q = 0}, {{v}},    {.q = 0},
        {.q = 0}, {{t}},    {.q = 0},
        {.q = 0}, {{p}},    {.q = 0},
        {.q = 0}, {{t}},    {.q = 0},
        {.q = 0}, {{n}},    {.q = 0},
        {.q = 0}, {{t}},    {.q = 0},
        {.q = 0}, {{o}},    {.q = 0}},
      { {.q = 0}, {{w3}},   {.q = 0},
        {.q = 0}, {{t}},    {.q = 0},
        {.q = 0}, {{p}},    {.q = 0},
        {.q = 0}, {{t}},    {.q = 0},
        {.q = 0}, {{n}},    {.q = 0},
        {.q = 0}, {{t}},    {.q = 0},
        {.q = 0}, {{p}},    {.q = 0},
        {.q = 0}, {{t}},    {.q = 0},
        {.q = 0}, {{m}},    {.q = 0},
        {.q = 0}, {{t}},    {.q = 0},
        {.q = 0}, {{p}},    {.q = 0},
        {.q = 0}, {{t}},    {.q = 0},
        {.q = 0}, {{v}},    {.q = 0},
        {.q = 0}, {{t}},    {.q = 0},
        {.q = 0}, {{o}},    {.q = 0}}};
  // clang-format on
  ω[0][2].t = ω[1];
  ω[1][2].t = ω[2];
  ω[2][2].t = ω[3];
  ω[3][2].t = ω[0];
  τext ο[512];
  ω[0][4].c(0, ω[0] + 4, ο, 0, 1);
  clear_gut();
  return 0;
}
